app/controllers/api/admin/dashboard_controller.rb

  def index
    metrics = {
      metrics: {
        locations: location.all.count,
        users: User.all.count
---
SELECT COUNT(*) FROM "users"