app/views/api/locations/index.json.jbuilder

json.locations @locations.each do |location|
---
SELECT "locations".* FROM "locations"